Repository: vakesz/Glasstual
Catalog: Sources/CocoaExtensions/SecureTransportErrorCodes.xcstrings
Source language: en
Languages: de, hu

# -9800
source: Generic protocol error
de: Allgemeiner Protokollfehler
hu: Általános protokollhiba

# -9801
source: Cipher suite negotiation failure
de: Aushandlung der Cipher-Suite fehlgeschlagen
hu: A titkosítási csomag egyeztetése sikertelen

# -9802
source: Fatal alert
de: Schwerwiegende Warnmeldung
hu: Végzetes riasztás

# -9803
source: I/O would block
de: Ein-/Ausgabe würde blockieren
hu: A bemeneti/kimeneti művelet blokkolna

# -9804
source: Attempt to restore an unknown session
de: Versuch, eine unbekannte Sitzung wiederherzustellen
hu: Ismeretlen munkamenet visszaállítási kísérlete

# -9805
source: Connection was closed gracefully
de: Verbindung ordnungsgemäß geschlossen
hu: A kapcsolat szabályosan lezárult

# -9806
source: Connection was closed as a result of an error
de: Verbindung aufgrund eines Fehlers geschlossen
hu: A kapcsolat hiba miatt lezárult

# -9807
source: Invalid certificate chain
de: Ungültige Zertifikatskette
hu: Érvénytelen tanúsítványlánc

# -9808
source: Invalid certificate format
de: Ungültiges Zertifikatsformat
hu: Érvénytelen tanúsítványformátum

# -9809
source: Underlying cryptographic error
de: Zugrunde liegender kryptografischer Fehler
hu: Mögöttes kriptográfiai hiba

# -9810
source: Internal error
de: Interner Fehler
hu: Belső hiba

# -9811
source: Module attach failure
de: Einbinden des Moduls fehlgeschlagen
hu: Modul csatolása sikertelen

# -9812
source: Valid certificate chain with an untrusted root
de: Gültige Zertifikatskette mit nicht vertrauenswürdigem Stammzertifikat
hu: Érvényes tanúsítványlánc nem megbízható gyökértanúsítvánnyal

# -9813
source: No root certificate for the certificate chain
de: Kein Stammzertifikat für die Zertifikatskette vorhanden
hu: A tanúsítványlánchoz nincs gyökértanúsítvány

# -9814
source: Certificate chain has an expired certificate
de: Die Zertifikatskette enthält ein abgelaufenes Zertifikat
hu: A tanúsítványlánc lejárt tanúsítványt tartalmaz

# -9815
source: Certificate chain has a certificate that is not yet valid
de: Die Zertifikatskette enthält ein noch nicht gültiges Zertifikat
hu: A tanúsítványlánc még nem érvényes tanúsítványt tartalmaz

# -9816
source: Server closed session with no notification
de: Der Server hat die Sitzung ohne Benachrichtigung geschlossen
hu: A kiszolgáló értesítés nélkül lezárta a munkamenetet

# -9817
source: Insufficient buffer provided
de: Der bereitgestellte Puffer ist zu klein
hu: A megadott puffer túl kicsi

# -9818
source: Improperly configured cipher suite
de: Falsch konfigurierte Cipher-Suite
hu: Hibásan beállított titkosítási csomag

# -9819
source: Unexpected message received
de: Unerwartete Nachricht empfangen
hu: Váratlan üzenet érkezett

# -9820
source: Bad MAC
de: Ungültiger Nachrichtenauthentifizierungscode
hu: Hibás üzenethitelesítési kód

# -9821
source: Decryption failed
de: Entschlüsselung fehlgeschlagen
hu: Sikertelen visszafejtés

# -9822
source: Record overflow
de: Datensatzüberlauf
hu: Rekordtúlcsordulás

# -9823
source: Decompression failure
de: Dekomprimierung fehlgeschlagen
hu: Sikertelen kitömörítés

# -9824
source: Handshake failure
de: Handshake fehlgeschlagen
hu: Sikertelen kézfogás

# -9825
source: Bad certificate
de: Fehlerhaftes Zertifikat
hu: Hibás tanúsítvány

# -9826
source: Invalid or unsupported certificate format
de: Ungültiges oder nicht unterstütztes Zertifikatsformat
hu: Érvénytelen vagy nem támogatott tanúsítványformátum

# -9827
source: Certificate revoked
de: Zertifikat widerrufen
hu: Visszavont tanúsítvány

# -9828
source: Certificate expired
de: Zertifikat abgelaufen
hu: Lejárt tanúsítvány

# -9829
source: Unknown certificate
de: Unbekanntes Zertifikat
hu: Ismeretlen tanúsítvány

# -9830
source: Illegal parameter
de: Unzulässiger Parameter
hu: Érvénytelen paraméter

# -9831
source: Unknown certificate authority
de: Unbekannte Zertifizierungsstelle
hu: Ismeretlen hitelesítésszolgáltató

# -9832
source: Access denied
de: Zugriff verweigert
hu: Hozzáférés megtagadva

# -9833
source: Decoding error
de: Dekodierungsfehler
hu: Dekódolási hiba

# -9834
source: Decryption error
de: Entschlüsselungsfehler
hu: Visszafejtési hiba

# -9835
source: Export restriction
de: Exportbeschränkung
hu: Exportkorlátozás

# -9836
source: Invalid protocol version
de: Ungültige Protokollversion
hu: Érvénytelen protokollverzió

# -9837
source: Insufficient security
de: Unzureichende Sicherheit
hu: Elégtelen biztonság

# -9838
source: Internal error
de: Interner Fehler
hu: Belső hiba

# -9839
source: User canceled
de: Vom Benutzer abgebrochen
hu: A felhasználó megszakította

# -9840
source: Renegotiation is not allowed
de: Erneute Aushandlung ist nicht erlaubt
hu: Az újraegyeztetés nem engedélyezett

# -9841
source: Peer certificate is valid or was ignored if verification is disabled
de: Das Zertifikat der Gegenstelle ist gültig oder wurde bei deaktivierter Prüfung ignoriert
hu: A partner tanúsítványa érvényes, vagy kikapcsolt ellenőrzés mellett figyelmen kívül maradt

# -9842
source: Server has requested a client-side certificate
de: Der Server hat ein Clientzertifikat angefordert
hu: A kiszolgáló kliensoldali tanúsítványt kért

# -9843
source: Host mismatch
de: Hostname stimmt nicht überein
hu: Eltérő gépnév

# -9844
source: Peer dropped connection before responding
de: Die Gegenstelle hat die Verbindung vor einer Antwort getrennt
hu: A partner válaszadás előtt bontotta a kapcsolatot

# -9845
source: Decryption failure
de: Entschlüsselung fehlgeschlagen
hu: Sikertelen visszafejtés

# -9846
source: Bad MAC
de: Ungültiger Nachrichtenauthentifizierungscode
hu: Hibás üzenethitelesítési kód

# -9847
source: Record overflow
de: Datensatzüberlauf
hu: Rekordtúlcsordulás

# -9848
source: Configuration error
de: Konfigurationsfehler
hu: Beállítási hiba

# -9849
source: Unexpected (skipped) record in DTLS
de: Unerwarteter (übersprungener) DTLS-Datensatz
hu: Váratlan (kihagyott) DTLS-rekord

# -9850
source: Server has a weak ephemeral Diffie-Hellman public key
de: Der Server verwendet einen schwachen temporären öffentlichen Diffie-Hellman-Schlüssel
hu: A kiszolgáló ideiglenes Diffie–Hellman nyilvános kulcsa gyenge

# -9851
source: Hello received
de: Hello-Nachricht empfangen
hu: Hello üzenet érkezett

# -9852
source: Socket shutdown (e.g. TCP RST or FIN)
de: Socket geschlossen (z. B. TCP RST oder FIN)
hu: Hálózati kapcsolat lezárása (például TCP RST vagy FIN)

# -9853
source: Network timeout
de: Netzwerk-Zeitüberschreitung
hu: Hálózati időtúllépés

# -9854
source: Configuration failed
de: Konfiguration fehlgeschlagen
hu: Beállítás sikertelen

# -9855
source: Unsupported extension
de: Nicht unterstützte Erweiterung
hu: Nem támogatott kiterjesztés

# -9856
source: Peer rejected unexpected message
de: Die Gegenstelle hat eine unerwartete Nachricht abgelehnt
hu: A partner elutasította a váratlan üzenetet

# -9857
source: Decompression failed
de: Dekomprimierung fehlgeschlagen
hu: Sikertelen kitömörítés

# -9858
source: Handshake failed
de: Handshake fehlgeschlagen
hu: Sikertelen kézfogás

# -9859
source: Decode failed
de: Dekodierung fehlgeschlagen
hu: Sikertelen dekódolás

# -9860
source: Inappropriate fallback
de: Ungeeigneter Fallback
hu: Nem megfelelő visszalépés

# -9861
source: Missing extension
de: Fehlende Erweiterung
hu: Hiányzó kiterjesztés

# -9862
source: Bad OCSP response
de: Ungültige OCSP-Antwort
hu: Hibás OCSP-válasz

# -9863
source: Certificate required
de: Zertifikat erforderlich
hu: Tanúsítvány szükséges

# -9864
source: Unknown PSK identity
de: Unbekannte PSK-Identität
hu: Ismeretlen PSK-azonosító

# -9865
source: Unknown or unrecognized name
de: Unbekannter oder nicht erkannter Name
hu: Ismeretlen vagy fel nem ismert név

# -9880
source: ATS violation
de: ATS-Verstoß
hu: ATS-szabálysértés

# -9881
source: ATS violation: minimum protocol version is not ATS compliant
de: ATS-Verstoß: Die minimale Protokollversion entspricht nicht den ATS-Anforderungen
hu: ATS-szabálysértés: a minimális protokollverzió nem felel meg az ATS követelményeinek

# -9882
source: ATS violation: selected ciphersuite is not ATS compliant
de: ATS-Verstoß: Die ausgewählte Cipher-Suite entspricht nicht den ATS-Anforderungen
hu: ATS-szabálysértés: a kiválasztott titkosítási csomag nem felel meg az ATS követelményeinek

# -9883
source: ATS violation: peer key size is not ATS compliant
de: ATS-Verstoß: Die Schlüsselgröße der Gegenstelle entspricht nicht den ATS-Anforderungen
hu: ATS-szabálysértés: a partner kulcsmérete nem felel meg az ATS követelményeinek

# -9884
source: ATS violation: peer leaf certificate hash algorithm is not ATS compliant
de: ATS-Verstoß: Der Hashalgorithmus des Endzertifikats entspricht nicht den ATS-Anforderungen
hu: ATS-szabálysértés: a partner végtanúsítványának kivonatoló algoritmusa nem felel meg az ATS követelményeinek

# -9885
source: ATS violation: peer certificate hash algorithm is not ATS compliant
de: ATS-Verstoß: Der Hashalgorithmus des Zertifikats der Gegenstelle entspricht nicht den ATS-Anforderungen
hu: ATS-szabálysértés: a partner tanúsítványának kivonatoló algoritmusa nem felel meg az ATS követelményeinek

# -9886
source: ATS violation: peer certificate is not issued by trusted peer
de: ATS-Verstoß: Das Zertifikat der Gegenstelle wurde nicht von einer vertrauenswürdigen Stelle ausgestellt
hu: ATS-szabálysértés: a partner tanúsítványát nem megbízható fél állította ki

# -9890
source: Early application data rejected by peer
de: Frühe Anwendungsdaten von der Gegenstelle abgelehnt
hu: A partner elutasította a korai alkalmazásadatokat

# -9999
source: Unknown
de: Unbekannt
hu: Ismeretlen

# error-description
source: Secure Transport Error: %1$@ (%2$ld)
de: Secure-Transport-Fehler: %1$@ (%2$ld)
hu: Secure Transport hiba: %1$@ (%2$ld)

# no-shared-cipher-suite
source: There was no cipher suite in common with the server.
de: Es gab keine mit dem Server gemeinsame Cipher-Suite.
hu: Nincs a kiszolgálóval közös titkosítási csomag.
